Revit 2027 API
TextNode.IsBold Property
 Indicates whether the default formatting is set to bold text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsBold { get; }
Public ReadOnly Property IsBold As Boolean
	Get
public:
property bool IsBold {
	bool get ();
}
member IsBold : bool with get
Property Value
Boolean
See Also
Reference
TextNode Class
Autodesk.Revit.DB Namespace